tiborsimon/embedded-tdd-headers/pic/8bit/pic18f442_tdd.h
#define IRVST                         522
#define OSCCON                        523
#define SCS                           524
#define T0CON                         525
#define T0PS                          526
#define T0PS0                         527
#define T0PS1                         528
#define T0PS2                         529
#define PSA                           530
#define T0SE                          531
#define T0CS                          532
#define T08BIT                        533
#define TMR0ON                        534
#define STATUS                        535
#define C                             536
#define CARRY                         537
#define DC                            538
#define ZERO                          539
#define Z                             540
#define OV                            541
#define OVERFLOW                      542
#define N                             543
#define NEGATIVE                      544
#define INTCON3                       545
#define INT1IF                        546
#define INT1F                         547
#define INT2IF                        548
#define INT2F                         549
#define INT1E                         550
#define INT1IE                        551
#define INT2IE                        552
#define INT2E                         553
#define INT1P                         554
#define INT1IP                        555
#define INT2IP                        556
#define INT2P                         557
#define INTCON2                       558
#define RBIP                          559
#define TMR0IP                        560
#define T0IP                          561
#define INTEDG2                       562
#define INTEDG1                       563
#define INTEDG0                       564
#define RBPU                          565
#define NOT_RBPU                      566
#define nRBPU                         567
#define INTCON                        568
#define RBIF                          569
#define INT0F                         570
#define INT0IF                        571
#define T0IF                          572
#define TMR0IF                        573
#define RBIE                          574
#define INT0E                         575
#define INT0IE                        576
#define T0IE                          577
#define TMR0IE                        578
#define PEIE                          579
#define PEIE_GIEL                     580
#define GIEL                          581
#define GIE_GIEH                      582
#define GIE                           583
#define GIEH                          584
#define STKPTR0                       585
#define STKPTR                        586
#define SP0                           587
#define STKPTR1                       588
#define SP1                           589
#define STKPTR2                       590
#define SP2                           591
#define SP3                           592
#define STKPTR3                       593
#define STKPTR4                       594
#define SP4                           595
#define STKUNF                        596
#define STKOVF                        597
#define STKFUL                        598

#endif // _PIC18F442_H_
